# YOLOv5x RGB-T with Minimal Attention (CBAM + CrossAttention)
# models/custom/yolov5x_kaist-rgbt-minimal-attention-final.yaml

# Parameters
nc: 4  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23]  # P3/8
  - [30, 61, 62, 45, 59, 119]  # P4/16
  - [116, 90, 156, 198, 373, 326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    # --- Dual-stream (changed section) ---
    [-1, 1, MultiStreamConv, [64, 6, 2, 2]],      # 0. P1/2
    [-1, 1, MultiStreamCBAM, [16]],               # 1. Lightweight attention (reduction=16)
    
    [-1, 1, MultiStreamConv, [128, 3, 2]],        # 2. P2/4
    [-1, 3, MultiStreamC3, [128]],                # 3.
    
    [-1, 1, DualStreamCrossAttention, [8, 8]],     # 4. Cross attention with 8 heads, window_size=8
    
    # --- Fusion and Single-stream (same as original structure) ---
    [-1, 1, Fusion, ['concat', 2]],               # 5. Fusion of two streams
    [-1, 1, Conv, [256, 1, 1]],                   # 6. Channel adjustment after fusion
    
    [-1, 1, Conv, [256, 3, 2]],                   # 7. P3/8
    [-1, 6, C3, [256]],                           # 8.
    
    [-1, 1, Conv, [512, 3, 2]],                   # 9. P4/16
    [-1, 9, C3, [512]],                           # 10.
    
    [-1, 1, Conv, [1024, 3, 2]],                  # 11. P5/32
    [-1, 3, C3, [1024]],                          # 12.
    
    [-1, 1, SPPF, [1024, 5]],                     # 13.
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]],                   # 14.
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],   # 15.
    [[-1, 10], 1, Concat, [1]],                   # 16. cat backbone P4
    [-1, 3, C3, [512, False]],                    # 17.

    [-1, 1, Conv, [256, 1, 1]],                   # 18.
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],   # 19.
    [[-1, 8], 1, Concat, [1]],                    # 20. cat backbone P3
    [-1, 3, C3, [256, False]],                    # 21. (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],                   # 22.
    [[-1, 17], 1, Concat, [1]],                   # 23. cat head P4
    [-1, 3, C3, [512, False]],                    # 24. (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],                   # 25.
    [[-1, 13], 1, Concat, [1]],                   # 26. cat head P5
    [-1, 3, C3, [1024, False]],                   # 27. (P5/32-large)

    [[21, 24, 27], 1, Detect, [nc, anchors]],     # Detect(P3, P4, P5)
  ]