# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license
# YOLOv5s with Cross-Attention Fusion for KAIST RGBT dataset

# Parameters
nc: 4 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:  # width-height
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone with Cross-Attention Fusion
backbone:
  # [from, number, module, args]
  [
    [-1, 1, MultiStreamConv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, MultiStreamConv, [128, 3, 2]], # 1-P2/4
    [-1, 3, MultiStreamC3TR, [128]], # 2-Self-attention in each stream
    [-1, 1, CrossAttentionFusion, [128]], # 3-Cross-attention between streams
    [-1, 1, Conv, [256, 3, 2]], # 4-P3/8
    [-1, 6, C3, [256]], # 5
    [-1, 1, Conv, [512, 3, 2]], # 6-P4/16
    [-1, 9, C3, [512]], # 7
    [-1, 1, Conv, [1024, 3, 2]], # 8-P5/32
    [-1, 3, C3, [1024]], # 9
    [-1, 1, SPPF, [1024, 5]], # 10
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]], # 11
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 12
    [[-1, 7], 1, Concat, [1]], # 13-cat backbone P4
    [-1, 3, C3, [512, False]], # 14

    [-1, 1, Conv, [256, 1, 1]], # 15
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 16
    [[-1, 5], 1, Concat, [1]], # 17-cat backbone P3
    [-1, 3, C3, [256, False]], # 18 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]], # 19
    [[-1, 14], 1, Concat, [1]], # 20-cat head P4
    [-1, 3, C3, [512, False]], # 21 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]], # 22
    [[-1, 10], 1, Concat, [1]], # 23-cat head P5
    [-1, 3, C3, [1024, False]], # 24 (P5/32-large)

    [[18, 21, 24], 1, Detect, [nc, anchors]], # 25-Detect(P3, P4, P5)
  ]
