# YOLOv5x RGB-T with Self-Attention and Cross-Attention
# models/custom/yolov5x_kaist-rgbt-attention.yaml

# Parameters
nc: 4  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23]  # P3/8
  - [30, 61, 62, 45, 59, 119]  # P4/16
  - [116, 90, 156, 198, 373, 326]  # P5/32

# YOLOv5 v6.0 backbone with attention
backbone:
  # [from, number, module, args]
  # Dual-stream processing with attention
  [
    [-1, 1, MultiStreamConv, [64, 6, 2, 2]],  # 0-P1/2
    [-1, 1, MultiStreamSelfAttention, [8]],          # 1 - num_heads=8
    [-1, 1, DualStreamCrossAttention, [8]],          # 2 - num_heads=8
    
    [-1, 1, MultiStreamConv, [128, 3, 2]],           # 3-P2/4
    [-1, 1, MultiStreamSelfAttention, [8]],          # 4 - num_heads=8
    [-1, 1, DualStreamCrossAttention, [8]],          # 5 - num_heads=8
    
    [-1, 3, MultiStreamC3Attention, [128]],          # 6 - C3 with built-in self attention
    [-1, 1, DualStreamCrossAttention, [8]],          # 7 - num_heads=8
    
    [-1, 1, Fusion, ['concat', 2]],           # 8 - Fusion of two streams
    [-1, 1, Conv, [256, 1, 1]],               # 9 - Channel adjustment after fusion
    
    # Single-stream processing with self-attention
    [-1, 1, Conv, [256, 3, 2]],               # 10-P3/8
    [-1, 6, C3TR, [256]],                     # 11 - C3 with transformer block
    
    [-1, 1, Conv, [512, 3, 2]],               # 12-P4/16
    [-1, 9, C3TR, [512]],                     # 13 - C3 with transformer block
    
    [-1, 1, Conv, [1024, 3, 2]],              # 14-P5/32
    [-1, 3, C3TR, [1024]],                    # 15 - C3 with transformer block
    
    [-1, 1, SPPF, [1024, 5]],                 # 16
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 13], 1, Concat, [1]],  # cat backbone P4
    [-1, 3, C3, [512, False]],   # 20

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 11], 1, Concat, [1]],  # cat backbone P3
    [-1, 3, C3, [256, False]],   # 24 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 20], 1, Concat, [1]],  # cat head P4
    [-1, 3, C3, [512, False]],   # 27 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 17], 1, Concat, [1]],  # cat head P5
    [-1, 3, C3, [1024, False]],  # 30 (P5/32-large)

    [[24, 27, 30], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]